// 사용 라이브러리
// 공식 라이브러리 ( 라이브러리 매니저에서 설치한 라이브러리 )
#include <SPI.h>
#include <Wire.h>

// 개인이 직접 추가한 라이브러리
#include "RTClib.h"
#include "EPD_2in9_V2.h"
#include "GUI_Paint.h"
#include "fonts.h"

// 전원(전체 시작 / 정지) / 모드 제어용 버튼 이름 지정
#define BTN_POWER  2
#define BTN_MODE   3

// 코딩에서 사용할 변수 선언
// enum = 숫자에 의미 있는 이름을 붙이는 방법
enum State { STUDY, REST };
State state = STUDY;

RTC_DS3231 rtc;

bool powerOn = false;

DateTime now;
uint32_t lastUnix = 0;
uint32_t studySec = 0;
uint32_t restSec  = 0;

unsigned long lastRTCRead = 0;
unsigned long lastDraw    = 0;
unsigned long powerOffRequestedAt = 0;

UBYTE *BlackImage;

// 공부중, 휴식중 옆에 함께 띄울 이모지
const uint8_t pen[32][32] = {
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,1,1,1,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,1,1,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,1,1,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,1,0,0,1,1,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,1,1,1,1,1,1,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,1,1,1,1,1,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,1,1,0,1,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,1,1,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0},
  {0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};

const uint8_t coffee[32][32] = {
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,1,0,1,1,0,1,1,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,1,1,1,1,1,1,1,1,0,0,0,0,1,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,1,1,1,0,1,1,1,0,0},
  {0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,1,1,0},
  {0,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,1,1,0},
  {0,1,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,1,0},
  {0,1,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,1,1,1,0},
  {0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0},
  {0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0},
  {0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0},
  {0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0},
  {0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};


void setup() {
  // 시리얼 & I2C 통신 시작
  Serial.begin(115200);
  Wire.begin();

  // 버튼 핀 설정
  pinMode(BTN_POWER, INPUT_PULLUP);
  pinMode(BTN_MODE,  INPUT_PULLUP);

  // RTC 모듈 시작
  rtc.begin();

  DEV_Module_Init();     // EPD 하드웨어 초기화
  EPD_2IN9_V2_Init();    // EPD 패널 초기화
  EPD_2IN9_V2_Clear();   // 화면 지우기
  EPD_2IN9_V2_Sleep();   // 저전력 모드로 전환

  UWORD Imagesize = ((EPD_2IN9_V2_WIDTH + 7) / 8) * EPD_2IN9_V2_HEIGHT;   // EPD 화면 전체를 담을 수 있는 크기 계산
  BlackImage = (UBYTE *)malloc(Imagesize);                                // 화면 사이즈만큼 버퍼 확보

  Paint_NewImage(BlackImage, EPD_2IN9_V2_WIDTH, EPD_2IN9_V2_HEIGHT, 90, WHITE);   // 앞서 만든 버퍼 초기화
  Paint_SelectImage(BlackImage);                                                  // 이미지 선택
  Paint_Clear(WHITE);                                                             // 화면을 흰색으로 초기화
}

void loop() {
  handlePowerButton();                // 공부 제어 버튼 제어 함수 불러오기

  if (!powerOn) return;               // powerOn 변수가 0이면 반환

  if (powerOffRequestedAt != 0) {     // 버튼을 한 번 누른 상태에서 한 번 더 눌렀을 경우,
    checkPowerOffTimer();             // 10초 카운트 후 EPD 초기화 하는 함수 불러오기
    return;
  }

  handleModeButton();                 // 휴식 제어 버튼 제어 함수 불러오기
  updateRTC();                        // RTC 제어 함수 불러오기
  updateDisplay();                    // EPD 제어 함수 불러오기
}

void handlePowerButton() {              // 공부 시작/중지 제어 함수
  static bool lastBtn = HIGH;
  bool btn = digitalRead(BTN_POWER);    // 공부 버튼 입력 값 받아오기

  // 함수 끝에 lastBtn에 btn 값을 넣어주고, 이전 값과 비교하여 다를 때 동작되도록 설정
  if (lastBtn == HIGH && btn == LOW) {
    if (!powerOn) {             // powerOn 변수가 0일 때
      // 🔌 POWER ON
      powerOn = true;           // powerOn 변수를 1로 셋
      state = STUDY;            // state를 공부중으로, 시간 값들을 0으로 초기화
      studySec = 0;
      restSec  = 0;
      powerOffRequestedAt = 0;

      now = rtc.now();
      lastUnix = now.unixtime();

      EPD_2IN9_V2_Init();       // 화면 한번 초기화
      EPD_2IN9_V2_Clear();
    } else {
      // 🔌 POWER OFF 요청
      powerOffRequestedAt = millis();
    }
  }
  lastBtn = btn;
}

void handleModeButton() {               // 휴식 시작/중지 제어 함수
  static bool lastBtn = HIGH;
  bool btn = digitalRead(BTN_MODE);

  if (lastBtn == HIGH && btn == LOW) {
    // state 가 STUDY면 REST로, STUDY가 아니면 STUDY로 값 지정
    state = (state == STUDY) ? REST : STUDY;   

    EPD_2IN9_V2_Clear();
  }
  lastBtn = btn;
}

void updateRTC() {            // RTC 업데이트 함수
  // RTC 읽은 이후 1초가 지났을 때 아래 코드 동작
  if (millis() - lastRTCRead < 1000) return;    

  // 지난 호출 이후 지난 시간 계산
  now = rtc.now();
  uint32_t u = now.unixtime();
  uint32_t diff = u - lastUnix;
  lastUnix = u;
  
  // 상태를 확인하여, 위에서 계산한 시간만큼 더하기
  if (state == STUDY) studySec += diff;
  else               restSec  += diff;

  lastRTCRead = millis();
}

void updateDisplay() {            // EPD 업데이트 함수
  // EPD 그리고 1초가 지났을 때 아래 코드 동작
  if (millis() - lastDraw < 1000) return;

  Paint_Clear(WHITE);   // 흰색으로 화면 초기화

  // state 값에 따라 상단 문구와 이모지 출력
  if (state == STUDY) {
    Paint_DrawString_EN(10, 10, "STATE: STUDY", &Font24, BLACK, WHITE);
    drawEmoji(220, 5, pen, 32);
  } else {
    Paint_DrawString_EN(10, 10, "STATE: REST", &Font24, BLACK, WHITE);
    drawEmoji(220, 5, coffee, 32);
  }

  // 하단에 공부 시간 및 휴식 시간 표시
  char buf[32];
  sprintf(buf, "STUDY | %luh : %lum : %lus", studySec / 3600, (studySec % 3600) / 60, (studySec % 3600) % 60);
  Paint_DrawString_EN(10, 40, buf, &Font16, BLACK, WHITE);

  sprintf(buf, "REST  | %luh : %lum : %lus", restSec / 3600, (restSec % 3600) / 60, (restSec % 3600) % 60);
  Paint_DrawString_EN(10, 60, buf, &Font16, BLACK, WHITE);

  // 각 사용 버튼 설명 기입
  Paint_DrawString_EN(10, 100, "BTN2: Power BUTTON", &Font12, BLACK, WHITE);
  Paint_DrawString_EN(10, 115, "BTN3: Mode Control", &Font12, BLACK, WHITE);

  // EPD 부분 갱신
  EPD_2IN9_V2_Display_Partial(BlackImage);

  lastDraw = millis();
}

// 공부 마쳤을 때, 실행시킬 화면 초기화 함수
void checkPowerOffTimer() {
  // 전원 OFF 요청이 있을 때에만, powerOffRequestAt 변수가 1일 때에만 아래 코드 동작
  if (powerOffRequestedAt == 0) return;

  // 10초 카운트 후 화면 초기화
  if (millis() - powerOffRequestedAt >= 10000) {
    EPD_2IN9_V2_Init();
    EPD_2IN9_V2_Clear();
    delay(500);

    powerOn = false;
    powerOffRequestedAt = 0;
  }
}

// 픽셀 크기만큼 for문으로 확인, 위치 값이 1이면, 픽셀 그리기
// 위에서 작성한 pen, coffee 이모지 그리는 함수
void drawEmoji(int x, int y, const uint8_t emoji[][32], int size) {
  for (int row = 0; row < size; row++) {
    for (int col = 0; col < size; col++) {
      if (emoji[row][col]) {
        Paint_DrawPoint(
          x + col,
          y + row,
          BLACK,
          DOT_PIXEL_1X1,
          DOT_STYLE_DFT
        );
      }
    }
  }
}
